app/Controllers/AuthCon.php

                } else {
                    $username = htmlspecialchars($this->request->getVar('username_pengguna'));
                    $password = htmlspecialchars($this->request->getVar('password_pengguna'));
                    $cek = $this->AuthModel->where('username', $username)->first();
---
SELECT *
FROM `pengguna`
WHERE `username` = 'asepjajang'
 LIMIT 1